Courses/7140/Lectures/Overview/software-quailities.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Software Quality</title>
<!-- 2018-06-10 Sun 19:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Software Quality</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. End</a></li>
</ul>
</div>
</div>
<p>
Collected opinions on software quality.
</p>

<ol class="org-ol">
<li>Hoare on Software Quality,
<a href="http://onlinelibrary.wiley.com/doi/10.1002/spe.4380020202/epdf">http://onlinelibrary.wiley.com/doi/10.1002/spe.4380020202/epdf</a>,
Software &#x2013; Practice and Experience, 103-105, 1972.
</li>

<li>A Few Opinions of Professor <a href="./hehner.html">Hehner</a>
</li>

<li>Bill Gates, RSA Conference, 2005: "64% of developers are not
confident in their ability to write secure applications."
</li>

<li>Bruce Schneier: "We wouldn't have to spend so much time and effort
on network security if we didn't have such bad software security."
&#x2013; Bruce Schneier, author of "Applied Cryptography", and "Secrets &amp;
Lies: Digital Security in a Networked World".
</li>

<li>"Malicious hackers don't create security holes; they simply
exploit them.  Security holes and vulnerabilities &#x2013; the real root
cause of the problem &#x2013; are the result of bad software design and
implementation."  &#x2013; John Viega &amp; Gary McGraw, authors of
Building Secure Software, 2001.
</li>

<li>"Have you ever written a program section with a security hole?
How did you know?" &#x2013; Mark G. Graff &amp; Kenneth R. van Wyk, authors of
"Secure Coding: Principles and Practices"
</li>

<li>"There is no software liability &#x2013; no incentive for secure software.
Most developers never learned to produce secure code.  Secure code
often takes a performance hit &#x2013; i.e., the software runs about 1/3
slower &#x2013; something many users don't want to tolerate.  Writing
secure code also takes a lot more time &#x2013; hence, development costs
are higher than usual.  Consequently, the longer development times
and the longer running times discourage developers from writing
secure code."
</li>

<li><a href="http://www.gnu.org/philosophy/shouldbefree.html">www.gnu.org/philosophy/ shouldbefree.html</a> Opinion
</li>
</ol>



<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> End</h2>
<div class="outline-text-2" id="text-1">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-04-28
</div>
</body>
</html>
